a= input("오늘의 기분은 어떠신가요?")


#뭘 만들지부터 생각해보자.

# 먼저 리스트가 주어진다.
# 오늘의 기분은 어떠신가요??

입력한다. 리스트로 반환. 메모장에 저장. 날짜별로 적었던 상태를 보여준다.

오늘은 어떻게 살것이죠?

지금 하고 있는생각은 무엇이죠??













"""
일요일 하나씩 다 풀어보고 
월요일 까지 다 봐보자.

그후에 선형대수 ㅇ양자역학도 공부 ㅍ해보자

ㅁ나ㅣㄻ니아림나리만러미ㅏㄴ어리만ㅇㄹ 너무 재밋싸디. ㅁㄴㅇㄹ[ㅁㄴㅇ라ㅣㅁㄴ어림ㄴㅇㄹ
ㅁㄴㅇ리ㅏㅁㄴ어룸ㄴ
ㅁㄴㅇ라ㅣㅁㄴ어


이세상을 
바ㅜㄲㄹ생ㅅㄱ가겡 ㅇ너누신다.ㄴ
ㅁㄴ안이신나ㅏ ㅏㅏㄴㅇ시ㅣ나단ㄴ


vscode://vscode.github-authentication/did-authenticate?windowid=3&code=b68e8a44c294d6abded2&state=15ae0906-99ab-41ef-8197-e856e4454434

https://github.com/zuha77/codename_F.sei.git

스스로의 게임속에 나 자신을 넣어

다리떨지말고.
멋있어지고 싶잖아
너도 변화 하고 싶잖아
그럼 해야지

나자신을 이 우주에 넣자.

나의 상태를 표시할 것들
(날씨, 시간, 기분, 

현실을 영화로 만들어
그를 위해서는 주인공, 음악, 시련, 사건이 필요하다.

먼저 뮤직큐.
주인공은 나다.
그후 나에게 주어진 사건들. 
어떻게 해결할래.
선택지는 이러이러하게 있다.
그중무엇을 선택하여도 너가 된다. 그중 선택지들을 귀납적으로 결론을 알려주겠다.
내가 해본선택지와 안해본 선택지.

매순간을 선택지의 연속으로 만든다. 커다란선택들.

어중간하게 하지말자.
약속을 지키자.
무엇하나 끝까지 혼을다해하자.
그거하나 열심히 안하는사람은 다른것도 과연 열심히 할까?


virtual_game_setting_requests. and reward.

선택지를 만들어주고 내가 선택하게 하는 게임..
선택지를 만들자. 그에 걸맞는 보상과 얻는것을 정하자.

게임을 만들어보자..
그 세상속에서 보상과 힘. 얻는것.

가상현실을 만들자..


"""

